Revit 2026 API

# MacroModuleIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Macro Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As Macro
	Get
```
```cpp
public:
virtual property Macro^ Current {
	Macro^ get ();
}
```
```fsharp
abstract Current : Macro with get
override Current : Macro with get
```

#### Property Value

Macro

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace